let handler  = async (m, { conn, usedPrefix: _p }) => {
let info =`
╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├°๖ۣۜۜ͜͡𝐇𝐨𝐥𝐚ঔৣֳ᷌᷈͜͡  𝐁𝐢𝐞𝐧𝐯𝐞𝐧𝐢𝐝𝐨 𝐚𝐥 
├⇶𝐈𝐍𝐒𝐓𝐀𝐋𝐀𝐂𝐈𝐎𝐍 𝐃𝐄𝐋 𝐁𝐎𝐓
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯
╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶🥳Gracias por solicitar💖
├⇶👩‍💻instalarBot de 🤖Hades_Bot 
├⇶Gracias por tu preferencia🌹💖
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯
╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶💥 𝐀𝐑𝐄𝐀 𝐃𝐄 𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒 💥
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤ Termux:
├⇶➤https://www.mediafire.com/file/scts5oxc74za98f/Termux+-+0.118.0.apk/file
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶💥 𝐀𝐑𝐄𝐀 𝐃𝐄 𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒 💥
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤ ZArchiver: 
├⇶➤https://www.mediafire.com/file/hdduane3e95ofbu/ZArchiver+-+0.9.4.apk/file
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶💥 𝐀𝐑𝐂𝐇𝐈𝐕𝐎𝐒 𝐃𝐄𝐋 𝐁𝐎𝐓 💥
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
⇶➤https://www.mediafire.com/file/9x6mdbbdtvt29ec/Hades_BotV3.zip/file
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶💥 𝐂𝐎𝐌𝐀𝐍𝐃𝐎𝐒 𝐃𝐄 𝐈𝐍𝐒𝐓𝐀𝐋𝐀𝐂𝐈𝐎𝐍 💥
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤ pkg update && pkg upgrade
├⇶➤ pkg install git -y
├⇶➤ pkg install nodejs -y
├⇶➤ pkg install ffmpeg -y
├⇶➤ pkg install imagemagick -y
├⇶➤ termux-setup-storage
├⇶➤ cd storage/downloads/Hades_BotV3
├⇶➤ ls
├⇶➤ npm install
├⇶➤ npm install -g npm@8.1.4
├⇶➤ npm update
├⇶➤ npm start
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
° Escaneas el código QR tienes 30 segundos para hacerlo
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶➤ 👩‍💻𝐏𝐚𝐲𝐏𝐚𝐲:
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤https://youtu.be/dfc4akKNn6A
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶➤ 💖𝐆𝐫𝐮𝐩𝐨𝐬 𝐨𝐟𝐢𝐜𝐢𝐚𝐥𝐞𝐬 𝐝𝐞𝐥 𝐁𝐨𝐭:1
├⇶➤https://chat.whatsapp.com/CG5ZPcJ22fL7QjNRzjguD0
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤💖 𝐆𝐫𝐮𝐩𝐨𝐬 𝐨𝐟𝐢𝐜𝐢𝐚𝐥𝐞𝐬 𝐝𝐞𝐥 𝐁𝐨𝐭:2
├⇶➤https://chat.whatsapp.com/DDm7HC6e5MF9qcdLqB22RQ
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤ 🥳𝐆𝐫𝐮𝐩𝐨 𝐝𝐞 𝐟𝐚𝐜𝐞𝐛𝐨𝐨𝐤:
├⇶➤https://www.facebook.com/groups/987464505464904/
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶➤𝐂𝐫𝐞𝐚𝐝𝐨𝐫 𝐝𝐞𝐥 𝐁𝐨𝐭
├⇶➤http://wa.me/5212411347465
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤𝐁𝐨𝐭 𝐚𝐜𝐭𝐢𝐯𝐨 𝐨𝐟𝐢𝐜𝐢𝐚𝐥:1
├⇶➤https://wa.me/5212412377467
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶➤ 𝐁𝐨𝐭 𝐚𝐜𝐭𝐢𝐯𝐨 𝐨𝐟𝐢𝐜𝐢𝐚𝐥 :2
├⇶➤https://wa.me/5212411719888
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶❍͜͡➣𝐇𝐀𝐃𝐄𝐒_𝐁𝐎𝐓❍͜͡➣
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯
`.trim() 
  conn.fakeReply(m.chat, info, '0@s.whatsapp.net', '❍͜͡➣𝐇𝐀𝐃𝐄𝐒_𝐁𝐎𝐓❍͜͡➣', 'status@broadcast')
}
//handler.help = ['ping', 'speed']
//handler.tags = ['info', 'tools']

handler.command = /^(instalarbot|INSTALARBOT)$/i
module.exports = handler

function clockString(ms) {
  let h = Math.floor(ms / 3600000)
  let m = Math.floor(ms / 60000) % 60
  let s = Math.floor(ms / 1000) % 60
  console.log({ms,h,m,s})
  return [h, m, s].map(v => v.toString().padStart(2, 0) ).join(':')
}