let fs = require('fs')
let fetch = require('node-fetch')
let moment = require('moment-timezone')
let path = require('path')
let util = require('util')
let handler = async (m, { conn, usedPrefix }) => {
let pp = './Menu2.jpg'
let who = m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
let username = conn.getName(who)
let vn = './media/naa.mp3'
let menu =`
╭━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━━╮
├°๖ۣۜۜ͜͡𝐇𝐨𝐥𝐚ঔৣֳ᷌᷈͜͡  ${username} 
├⇶𝐁𝐢𝐞𝐧𝐯𝐞𝐧𝐢𝐝𝐨 𝐚𝐥 
├⇶𝐦𝐞𝐧ú 𝐝𝐞 𝐎𝐩𝐜𝐢𝐨𝐧𝐞𝐬
╰━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━━╯
╭━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━━╮
├𝐌𝐄𝐍Ú 𝐃𝐄 𝐎𝐏𝐂𝐈𝐎𝐍𝐄𝐒
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├☙⃝♡〫𝐈𝐍𝐅𝐎𝐑𝐌𝐀𝐂𝐈Ó𝐍☙⃝♡〫
├⇶/𝚒𝚗𝚏𝚘𝚛𝚖𝚊𝚌𝚒ó𝚗 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├𑁍〪〫⃕͜⛧🏅𝐓𝐎𝐏𝐒.🏅۪̇𑁍〪〫⃕͜⛧
├⇶/𝚝𝚘𝚙𝚜
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├🌹⃟🎮𝐉𝐔𝐄𝐆𝐎𝐒🌹⃟🎳
├⇶/𝙹𝚄𝙴𝙶𝙾𝚂 /𝚓𝚞𝚎𝚐𝚘𝚜
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├🗃️⃟ᮬ᮫፝𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒🗃️⃟ᮬ᮫፝
├⇶/𝙳𝙴𝚂𝙲𝙰𝚁𝙶𝙰𝚂
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├✧͢⃟ᤢ💎𝐆𝐄𝐒𝐓𝐈𝐎𝐍✧͢⃟ᤢ💎
├⇶/𝙶𝙴𝚂𝚃𝙸𝙾𝙽
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├📈𝐄𝐒𝐓𝐀𝐃𝐎 𝐃𝐄𝐋 𝐁𝐎𝐓✔️
├⇶/𝙴𝚜𝚝𝚊𝚍𝚘
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├♦️𝐈𝐍𝐒𝐓𝐀𝐋𝐀 𝐁𝐎𝐓🔥
├⇶/instalarbot
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❀⃝⃨⃕⁖𝐌𝐄𝐍Ú𝐒𝐈𝐌𝐏𝐋𝐄❀⃝⃨⃕⁖
├⇶/𝙼𝚎𝚗ú𝚂𝚒𝚖𝚙𝚕𝚎 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶✧͢⃟ᤢ🧨𝐋𝐎𝐆𝐎𝐒✧͢⃟ᤢ🧨
├⇶/logos
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❀⃯⃝⃯੭𝐈𝐍𝐕𝐎𝐂𝐀𝐑 𝐆𝐔𝐑𝐏𝐎❀⃯⃝⃯੭
├⇶/𝚒𝚗𝚟𝚘𝚌𝚊𝚛 /𝚝𝚊𝚐𝚊𝚕𝚕 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├🎧𝐌𝐄𝐍𝐔 𝐃𝐄 𝐀𝐔𝐃𝐈𝐎𝐒🎧
├⇶/𝙼𝚎𝚗𝚞2
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❍͜͡𝐌𝐄𝐍Ú 𝐂𝐎𝐌𝐏𝐋𝐄𝐓𝐎❍͜͡➣
├⇶/𝙼𝚎𝚗𝚞𝚌𝚘𝚖𝚙𝚕𝚎𝚝𝚘 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❥᳆𝐈𝐍𝐅𝐎𝐁𝐎𝐓❥᳆
├⇶/𝚒𝚗𝚏𝚘𝚋𝚘𝚝
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❤️⃟⃪͡ꦽ𝐂𝐑𝐄𝐀𝐃𝐎𝐑𝐄𝐒❤️⃟⃪͡ꦽ
├⇶/𝙲𝚁𝙴𝙰𝙳𝙾𝚁𝙴𝚂 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❍⃕⃟᎒⃟̀👾𝐑𝐀𝐍𝐃𝐎𝐌❍⃕⃟᎒⃟̀🪩
├⇶/𝚁𝙰𝙽𝙳𝙾𝙼
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├🍷⃟🎧𝐄𝐅𝐄𝐂𝐓𝐎𝐒🍷⃟🎧
├⇶/𝙴𝙵𝙴𝙲𝚃𝙾𝚂 𝙰𝚄𝙳𝙸𝙾𝚂 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├✾⃝᭄🤖𝐔𝐍𝐄 𝐔𝐍 𝐁𝐎𝐓✾⃝᭄🤖 
├⇶/𝚀𝚞𝚎 𝚎𝚜 𝚞𝚗 𝙱𝚘𝚝? 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❍͜͡𝐆𝐑𝐔𝐏𝐎𝐒 𝐃𝐄𝐋 𝐁𝐎𝐓❍͜͡➣
├⇶/𝚐𝚛𝚞𝚙𝚘𝚜 𝚘𝚏𝚒𝚌𝚒𝚊𝚕𝚎𝚜
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├🏧𝐓É𝐑𝐌𝐈𝐍𝐎𝐒⚕️
├⇶/𝚃𝚎𝚛𝚖𝚒𝚗ó 𝚜𝚎 𝚞𝚜𝚘
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├👮𝐑𝐄𝐏𝐎𝐑𝐓𝐄🕵️
├⇶/𝚛𝚎𝚙𝚘𝚛𝚝 /𝚛𝚎𝚙𝚘𝚛𝚝𝚎
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├☠︎︎⃟ࣩࣧ⸸₂₀ᷳ₂ᷫ₁ͨꦿяєνєℓα¢ιóи➣⃘⃕͜⃟⃤꙰.
├⇶/𝚁𝚎𝚌𝚕𝚞𝚝𝚊𝚖𝚒𝚎𝚗𝚝𝚘
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├❀⃯⃝⃯🧑‍🏫𝐑𝐄𝐆𝐋𝐀𝐒❀⃯⃝⃯🧑‍🏫
├⇶/𝚛𝚎𝚐𝚕𝚊𝚜 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├☙꙰⃝📝️𝐏𝐄𝐑𝐒𝐎𝐍𝐀𝐋☙꙰⃝📝️
├⇶/ᴩᴇʀꜱᴏɴᴀʟɪᴢᴀᴅᴏꜱ
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├👑⃟⟫𝐏𝐑𝐎𝐏𝐈𝐄𝐓𝐀𝐑𝐎👑⃟⟫
├⇶/𝙿𝚁𝙾𝙿𝙸𝙴𝚃𝙰𝚁𝙾
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⋆⃟ۣۜ🔞𝐋𝐀𝐁𝐈𝐁𝐋𝐈𝐀 ⃘่͜͡☔
├⇶/𝚕𝚊𝚋𝚒𝚋𝚕𝚒𝚊
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├💌𝐃𝐎𝐍𝐀𝐑❤️
├⇶/𝚍𝚘𝚗𝚊𝚛 /𝚊𝚙𝚘𝚢𝚊𝚛
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├ ݈݇➭ꪖ𝐂𝐑𝐄𝐀𝐃𝐎𝐑 ݈݇➭ꪖ
├⇶/𝚘𝚠𝚗𝚎𝚛 /𝚌𝚛𝚎𝚊𝚍𝚘𝚛
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├▧⃯⃟Ⓜ️𝐔𝐍𝐄 𝐔𝐍 𝐁𝐎𝐓 ▧⃯⃟Ⓜ️
├⇶/𝙴𝚗𝚝𝚛𝚊𝚋𝚘𝚝
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├𖤌⃝͜⛩️𝐑𝐄𝐏𝐎𝐑𝐓𝐀𖤌⃝͜⛩️
├⇶/𝚁𝙴𝙿𝙾𝚁𝚃𝙰
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├𖥨⸽⃟👻𝐀𝐍𝐎𝐍𝐈𝐌𝐎𖥨⸽⃟👻
├⇶/𝙰𝙽𝙾𝙽𝙸𝙼𝙾
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├➶⃟🅦𝐂𝐎𝐍𝐕𝐈𝐄𝐑𝐓𝐄𝐓𝐄➶⃟🅦
├⇶/𝙲𝙾𝙽𝚅𝙸𝙴𝚁𝚃𝙴𝚃𝙴 
╰━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━━╯

╭━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━━╮
├⇶❍͜͡➣𝐇𝐀𝐃𝐄𝐒_𝐁𝐎𝐓❍͜͡➣
╰━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━━╯
`.trim()
let mentionedJid = [who]
conn.send3ButtonImg(m.chat, pp, menu,'❍͜͡➣𝐇𝐀𝐃𝐄𝐒_𝐁𝐎𝐓❍͜͡➣', '❍͜͡➣𝐈𝐍𝐅𝐎𝐑𝐌𝐀𝐂𝐈Ó𝐍❍͜͡➣〫️️', `#información`, '.❍͜͡➣۪̇〬𝐓𝐎𝐏𝐒.❍͜͡➣۪̇〬', `#tops`, '❍͜͡➣𝐉𝐔𝐄𝐆𝐎𝐒❍͜͡➣', `#JUEGOS`, m, false, { contextInfo: { mentionedJid }})   
await await await await await await conn.sendFile(m.chat, vn, 'naa.mp3', null, m, true, {
type: 'audioMessage', 
ptt: true 
})
}
handler.command = /^(menu|menú|memu|memú|help|comandos|allmenu|2help|menu1.2|ayuda|commands|commandos)$/i
handler.fail = null
module.exports = handler