let handler  = async (m, { conn, usedPrefix: _p }) => {
let info =`
╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶¡мpεя¡σ мครтεя
├⇶hola bien Bienvenid@s 
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶¡мpεя¡σ мครтεя
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶Presentarse
├⇶con foto 
├⇶nombre 
├⇶edad 
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶𝐈𝐍𝐅𝐎𝐑𝐌𝐀𝐂𝐈Ó𝐍
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶❥ᰰຼ💎⃟ᬽLo que se hace en esta legion 
├⇶❥ᰰຼ💎⃟ᬽSomo un Legion los mejores
├⇶❥ᰰຼ💎⃟ᬽAtacamos grupos xxx
├⇶❥ᰰຼ💎⃟ᬽMandar a soporte 
├⇶❥ᰰຼ💎⃟ᬽHacker teléfonos
├⇶❥ᰰຼ💎⃟ᬽRobar número de WhatsApp
├⇶❥ᰰຼ💎⃟ᬽHacker Facebook
├⇶❥ᰰຼ💎⃟ᬽHacer números virtuales
├⇶❥ᰰຼ💎⃟ᬽHacer virus
├⇶❥ᰰຼ💎⃟ᬽEspira las personas 
├⇶❥ᰰຼ💎⃟ᬽHacer su propio WhatsApp 
├⇶❥ᰰຼ💎⃟ᬽMandar WhatsApp inmunes
├⇶❥ᰰຼ💎⃟ᬽTroyanos
├⇶❥ᰰຼ💎⃟ᬽPuedes usar el bot la legión 
├⇶❥ᰰຼ💎⃟ᬽRecuperar contraseñas 
├⇶❥ᰰຼ💎⃟ᬽAtacar legiones hacen cosa por diversión 
├⇶❥ᰰຼ💎⃟ᬽJoder personas cp
├⇶❥ᰰຼ💎⃟ᬽEnvira virus en laboratorio 
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶¡мpεя¡σ мครтεя
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶Si quieres a prender 
├⇶ponte las insignias 
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶ INSIGNIAS 
├━━━━≪✯𓆩ֶ፝֟𓆪⁩✯≫━━━╯
├⇶❥ᰰຼ💎⃟ᬽ™️    ™️💎⃟ᬽ፝֟❥
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶❥ᰰຼ💎⃟ᬽGracias por su atención 
├⇶❥ᰰຼ💎⃟ᬽSomos una legión
├⇶❥ᰰຼ💎⃟ᬽTodo esto lo hacemos con el fin de hacer le bien 
├⇶❥ᰰຼ💎⃟ᬽNo por beneficios propio
├⇶❥ᰰຼ💎⃟ᬽ™️¡мpεя¡σ мครтεя™️💎⃟ᬽ፝֟❥
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶https://chat.whatsapp.com/LGvb0X9GJM0LXE6yvWIE6x
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯

╭━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╮
├⇶❍͜͡➣𝐇𝐀𝐃𝐄𝐒_𝐁𝐎𝐓❍͜͡➣
╰━━━━━✯𓆩ֶ፝֟𓆪⁩✯━━━━━╯
`.trim() 
conn.fakeReply(m.chat, info, '0@s.whatsapp.net', '❍͜͡➣𝐇𝐀𝐃𝐄𝐒_𝐁𝐎𝐓❍͜͡➣', 'status@broadcast')
}
handler.command = /^(Reclutamiento|Reclutamiento|Reclutamiento )$/i

module.exports = handler
